package ch_06_method;

public class method {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/*
		 메서드 사용의 장점
		 1. 코드 반복을 줄일 수 있음
		 대부분의 프로그램은 어떤 코드를 반복해서 사용. 코드를 개선하거나 유지보수할 때 여러 부분을 수정해야 하는 일이 발생하면 귀찮은 일이 많아짐.
		 코드의 유지보수가 쉽게 될 수 있도록 메서드를 활용. '반복하지 마라' 원칙을 지키는 대표적인 방법임
		 
		 2. 더 높은 추상화를 할 수 있음
		 세부 코드를 하나하나 신경쓰기보다 '메서드 이름'만으로 원하는 처리를 할 수 있도록 함
		 
		 결론적으로 메서드를 만들면 1)기본 로직을 읽기에 쉽고 2)재사용이 용이하다는 장점이 있음
		 
		 
		 메서드의 특징은
		 1)어떤 입력을 받아 2)특정 연산을 수행한 뒤 3)결과를 반환함
		 
		 
		 용어정리
		 1. 메서드 정의 : 메서드를 새로 만드는 것을 의미
		 2. 인수 : 메서드에 전달할 입력(input)을 의미. argument
		 3. 매개변수 : 인수를 받아서 저장하는 변수를 의미. parameter
		 4. 반환값 : 메서드의 출력(output)을 의미. return
		 5. 메서드 호출 : 메서드를 실제로 사용하는 것을 의미
		 */

	}

}
