package ch_05_array;

public class Array {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// 배열은 같은 타입의 변수를 하나의 묶음으로 관리 - 속도가 빠름
		// 배열의 특징 - 처음에 갯수 지정 해야함, 같은 자료형만 넣을 수 있음
		
		//배열을 사용하지 않을 시 하나하나 다 변수 선언해야하지만
		//int stduent1, student2, ... , student 100;
		
		//배열 사용시 길이가 100인 배열을 만들어 묶으면 됨
		//int[]student = new int[100];
		
		//대부분 배열의 선언과 생성을 동시에 함
		//타입[]배열이름 = new타입[길이] 		ex)int[]student = new int[30]
		
		//인덱스
		//	방이 500개. 각 방에 접근해려면 어떻게 해야 될까. 첫번쨰 방의 것만 들고오고싶다면?. 
		//	접근하기 위해 하나하나 이름을 지정해야 되면 배열을 사용하는 목적과 부합x
		//	그럼 방에 자동으로 번호가 지정되어 있다면 어떨까?
		//	그래서 인덱스 사용. 첫번째 방의 번호 0번부터 시작하여, 마지막 방의 번호 499로 라벨링.
		//	a[0] , ... , a[499]
		

	}

}
